print('Задача 4. Крест')

# Напишите программу,
# которая выводит на экран крест из символов “^”.
#
# (Символы выводятся по диагоналям воображаемого квадрата.)

# ^        ^
#  ^      ^
#   ^    ^
#    ^  ^
#     ^^
#     ^^
#    ^  ^
#   ^    ^
#  ^      ^
# ^        ^

# basic_a = 8
# for a in range(basic_a):
#     for b in range(basic_a):
#         print(f'{" "* (b-a)}^{" "* (b-a)}^{" "* (b-a)}')
#     print()

