print('Задача 4. Крест')

# Напишите программу,
# которая выводит на экран крест из символов “^”.
#
# (Символы выводятся по диагоналям воображаемого квадрата.)

# ^        ^
#  ^      ^
#   ^    ^
#    ^  ^
#     ^^
#     ^^
#    ^  ^
#   ^    ^
#  ^      ^
# ^        ^

basic_a = 12
for a in range(1, basic_a + 1):
    for b in range(1, basic_a + 1):
        if b == a:
            print('^', end='')
        elif a == basic_a + 1 - b:
            print('^', end='')
        else:
            print(' ', end='')
    print()
