# Напишите программу, которая запрашивает у пользователя длины двух катетов в прямоугольном треугольнике
# и выводит его площадь.
side_a = int(input('Введите длину 1-го катета: '))
side_b = int(input('Введите длину 2-го катета: '))
print((side_a*side_b)/2)
